sisext-sapi-services/src/main/resources/soap/schemas/templates/soap-wsConsultaCupoNegLISIM-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:tem="http://tempuri.org/">
    <soapenv:Header/>
    <soapenv:Body>
        <tem:CalculoCupo>
            <!--Optional:-->
            <tem:autenticacion>
                <!--Optional:-->
                <tem:Usuario>#[p('consultaCupoNegLISIM.properties.user')]</tem:Usuario>
                <!--Optional:-->
                <tem:Clave>#[p('consultaCupoNegLISIM.properties.password')]</tem:Clave>
            </tem:autenticacion>
            <!--Optional:-->
            <tem:objCalculo>
                <tem:IdSolicitud>#[payload.quoteCalculation.calculationObject.requestId]</tem:IdSolicitud>
                <!--Optional:-->
                <tem:InfBasicaEmpresa>
                    <!--Optional:-->
                    <tem:RazonSocial>#[payload.quoteCalculation.calculationObject.companyBasicInformation.businessName]</tem:RazonSocial>
                    <tem:TipoIdentificacion>#[payload.quoteCalculation.calculationObject.companyBasicInformation.identificationType]</tem:TipoIdentificacion>
                    <!--Optional:-->
                    <tem:Identificacion>#[payload.quoteCalculation.calculationObject.companyBasicInformation.identification]</tem:Identificacion>
                    <tem:Ciudad>#[payload.quoteCalculation.calculationObject.companyBasicInformation.city]</tem:Ciudad>
                    <!--Optional:-->
                    <tem:Direccion>#[payload.quoteCalculation.calculationObject.companyBasicInformation.address]</tem:Direccion>
                </tem:InfBasicaEmpresa>
                <!--Optional:-->
                <tem:InfAdicionalEmpresa>
                    <tem:ActividadEconomica>#[payload.quoteCalculation.calculationObject.companyAdditionalInformation.economicActivity]</tem:ActividadEconomica>
                    <tem:FechaConstitucion>#[output application/java --- payload.quoteCalculation.calculationObject.companyAdditionalInformation.constitutionDate]</tem:FechaConstitucion>
                    <tem:Estrato>#[payload.quoteCalculation.calculationObject.companyAdditionalInformation.stratum]</tem:Estrato>
                    <tem:IdZona>#[payload.quoteCalculation.calculationObject.companyAdditionalInformation.zoneId]</tem:IdZona>
                </tem:InfAdicionalEmpresa>
                <!--Optional:-->
                <tem:RepresentanteLegal>
                    <!--Optional:-->
                    <tem:Nombres>#[payload.quoteCalculation.calculationObject.legalRepresentative.names]</tem:Nombres>
                    <!--Optional:-->
                    <tem:Apellidos>#[payload.quoteCalculation.calculationObject.legalRepresentative.surnames]</tem:Apellidos>
                    <tem:TipoIdentificacion>#[payload.quoteCalculation.calculationObject.legalRepresentative.identificationType]</tem:TipoIdentificacion>
                    <!--Optional:-->
                    <tem:FechaNacimiento>#[output application/java --- payload.quoteCalculation.calculationObject.legalRepresentative.dateBirth]</tem:FechaNacimiento>
                    <tem:Identificacion>#[output application/java --- payload.quoteCalculation.calculationObject.legalRepresentative.identification]</tem:Identificacion>
                </tem:RepresentanteLegal>
                <!--Optional:-->
                <tem:BalanceGeneral>
                    <tem:TotalActivoCorriente>#[payload.quoteCalculation.calculationObject.generalBalance.totalCurrentAssets]</tem:TotalActivoCorriente>
                    <tem:Inventarios>#[payload.quoteCalculation.calculationObject.generalBalance.inventories]</tem:Inventarios>
                    <tem:TotalActivos>#[payload.quoteCalculation.calculationObject.generalBalance.totalAssets]</tem:TotalActivos>
                    <tem:TotalPasivoCorriente>#[payload.quoteCalculation.calculationObject.generalBalance.totalCurrentLiabilities]</tem:TotalPasivoCorriente>
                    <tem:TotalPasivo>#[payload.quoteCalculation.calculationObject.generalBalance.totalLiabilities]</tem:TotalPasivo>
                    <tem:TotalPatrimonio>#[payload.quoteCalculation.calculationObject.generalBalance.totalPatrimony]</tem:TotalPatrimonio>
                </tem:BalanceGeneral>
                <!--Optional:-->
                <tem:EstadoResultados>
                    <tem:IngresosOperacionalesAnioCorriente>#[payload.quoteCalculation.calculationObject.statusResults.currentYearOperatingRevenue]</tem:IngresosOperacionalesAnioCorriente>
                    <tem:IngresosNoOperacionalesAnioCorriente>#[payload.quoteCalculation.calculationObject.statusResults.currentYearNoOperatingRevenue]</tem:IngresosNoOperacionalesAnioCorriente>
                    <tem:IngresosOperacionalesAnioAnterior>#[payload.quoteCalculation.calculationObject.statusResults.previousYearOperatingRevenue]</tem:IngresosOperacionalesAnioAnterior>
                    <tem:IngresosNoOperacionalesAnioAnterior>#[payload.quoteCalculation.calculationObject.statusResults.previousYearNoOperatingRevenue]</tem:IngresosNoOperacionalesAnioAnterior>
                    <tem:CostoVenta>#[payload.quoteCalculation.calculationObject.statusResults.costSale]</tem:CostoVenta>
                    <tem:GastosOperacionales>#[payload.quoteCalculation.calculationObject.statusResults.operationalExpenses]</tem:GastosOperacionales>
                    <tem:UtilidadesOperacionales>#[payload.quoteCalculation.calculationObject.statusResults.operationalProfit]</tem:UtilidadesOperacionales>
                    <tem:OtrosEgresos>#[payload.quoteCalculation.calculationObject.statusResults.otherExpenses]</tem:OtrosEgresos>
                    <tem:UtilidadNeta>#[payload.quoteCalculation.calculationObject.statusResults.netProfit]</tem:UtilidadNeta>
                    <tem:UtilidadAntesDeImpuestos>#[payload.quoteCalculation.calculationObject.statusResults.beforeTaxProfit]</tem:UtilidadAntesDeImpuestos>
                    <tem:ImpuestosRentaYComplementarios>#[payload.quoteCalculation.calculationObject.statusResults.incomeTaxAndComplementary]</tem:ImpuestosRentaYComplementarios>
                    <tem:CuentasPorCobrar>#[payload.quoteCalculation.calculationObject.statusResults.accountReceivable]</tem:CuentasPorCobrar>
                    <tem:ObligacionesFinancieras>#[payload.quoteCalculation.calculationObject.statusResults.financialObligations]</tem:ObligacionesFinancieras>
                </tem:EstadoResultados>
                <!--Optional:-->
                <tem:Politica>
                    <!--Optional:-->
                    <tem:Descripcion></tem:Descripcion>
                </tem:Politica>
            </tem:objCalculo>
        </tem:CalculoCupo>
    </soapenv:Body>
</soapenv:Envelope>